# 1、AI
# AI：人工智能（Artificial Intelligence），是一个科学领域的统称，目标就是使机器能够像人类一样思考、学习、推理和解决问题。

# 2、AI 大模型
# AI大模型：也称为大语言模型（Large Language Models，LLM），是AI技术的一个分支。
# 其实就是一个用代码模拟人脑神经网络的程序（参数量及其庞大，通常达到数十亿至数千亿级别），通过大量的数据训练后，使其具备理解人类语言、思考、推理并输出人类语言的能力。
# 代码+数据算法，模拟人脑神经网络的软件程序。

# 3、AI 应用
# AI 应用：是指将 AI 大模型技术落地到具体的业务场景中，用来解决实际问题的产品或者服务。


# 4、学习目录：
# AI应用 - 基础
#   - 大模型部署
#   - 大模型调用
#   - 提示工程（Prompt Engineering）
# AI应用 - 实战
#   - Streamlit 库的基本使用
#   - AI 智能伴侣 - 基本交互
#   - AI 智能伴侣 - 会话记忆
#   - AI 智能伴侣 - 侧边栏功能
#
# AI应用 - 会话（对话）管理
#   - AI 智能伴侣 - 新建会话
#   - AI 智能伴侣 - 保存会话
#   - AI 智能伴侣 - 加载历史会话
#   - AI 智能伴侣 - 删除会话
# 
