# set 集合常用方法

# 1、add() 方法：向集合中添加一个元素
s = {1, 2, 3}
s.add(4)
s.add(4)
print(s)  # {1, 2, 3, 4}

print("--------------------")

# 2、remove() 方法：从集合中删除一个指定元素

s.remove(4)
print(s)

print("--------------------")

# 3、pop() 方法：随机删除集合中的一个元素，并返回这个元素
s1 = s.pop()
print("s =", s)   # s = {2, 3}
print("s1 =", s1)   # s1 = 1

print("--------------------")

# 4、clear() 方法：清空集合
s.clear()
print("s =", s)  # s = set()

print("--------------------")

# 5、s1.difference(s2) 方法：求取2个集合的差集, 即返回存在于第一个集合(s1)中，但不存在于第二个集合(s2)中的所有元素

s1 = {1, 2, 3, 5}
s2 = {2, 3, 4}
oS = s1.difference(s2)
print("元素存在 s1 但不存在 s2 中的所有元素, s =", oS)  # {1, 5}

print("--------------------")

# 6、union() 方法：求取2个集合的并集

s1 = {1, 2, 3, 5}
s2 = {2, 3, 4}
uS = s1.union(s2)
print("两个集合的并集, s =", uS)  # {1, 2, 3, 4, 5}

print("--------------------")

# 7、intersection() 方法：返求取2个集合的交集
s1 = {1, 2, 3, 5}
s2 = {2, 3, 4}
iS = s1.intersection(s2)
print("两个集合的交集, s =", iS)  # {2, 3}