# 👉 1、list 列表切片
# 列表切片：从现有列表中获取一个子列表，称为切片。
# 语法：
#     列表名[起始索引:结束索引:步长]
# 注意：
#     1、起始索引默认是 0；结束索引默认值 len(列表)，即列表长度；步长默认值 1，即每次取一个元素；这3个值都是可选的。
#     2、包含起始索引，不包含结束索引；
#     3、起始索引和结束索引可以是负数，表示从后往前取值
# 
# 序列类型，如 list 列表，字符串，元组等，都可以进行切片操作。

a = ['a', 'b', 'c', 'd', 'e']
print(a[:])        # ['a', 'b', 'c', 'd', 'e']
print(a[::])       # ['a', 'b', 'c', 'd', 'e']
print(a[::-1])     # ['e', 'd', 'c', 'b', 'a']
print(a[1:3])      # ['b', 'c']
print(a[0:5:2])    # ['b', 'c']
print(a[1:-1])     # ['b', 'c', 'd']
print(a[1:-1:2])   # ['b', 'd']


# 👉 2、通过列表切片修改元素
a = [1, 2, 3, 4, 5, 6, 7, 8]
a[0:5] = ['a', 'b']
print("-- 修改后的 a = ", a)    # ['a', 'b', 6, 7, 8]
