# 1、tuple 元组
# 元组类似 list 列表，最大的区别是，元组是不可变的序列，一旦创建了元组，就不能修改它。
# 元组特点：
#   - 元素可以是任何类型的，包括数字、字符串、布尔值等。
#   - 元素可以重复、有序、不可以修改。
#   - 元组支持索引访问，切片。
#
# 元组定义语法：
#   - 使用 () 括起来多个元素，中间用逗号隔开，即：元组名 = (元素1, 元素2, ...)

# 定义空元组
tup1 = ()
tup2 = tuple()
print(type(tup1))   # <class 'tuple'>

# 定义单个元素的元组
# ⚠️，如果定义单个元素的元组，需要在元素后面加上逗号，否则会被当做单个字面量处理
tup3 = (1)
print(type(tup3))   # <class 'int'>
tup3 = (1,)
print(type(tup3))   # <class 'tuple'>

print("------------------------------")

tup3 = (1, 2, 3, 4, 5, True, 3.14, "hello")
print(tup3)

# 2、索引访问
print(tup3[0])     # 1
print(tup3[-1])    # hello

print("------------------------------")

# 3、切片，[start:end:step]
print(tup3[:-1])   # (1, 2, 3, 4, 5, True, 3.14)
print(tup3[::2])  # (1, 3, 5, 3.14)

print("------------------------------")

# 4、元组常用的方法
# 由于元组不支持修改，只允许查询，所以常用的只有2个
# 1、index() 查找元素在元组中的位置
# 2、count() 统计元素在元组中出现的次数
t = ("a", "b", "c", "a", "c", "d")
print(t.index("a"))   # 0
print(t.count("a"))   # 2
