# 组包（Packing）：将多个值合并到一个容器（列表、元组）中。
# 解包（Unpacking）：将一个容器（列表、元组）解开成独立的元素，分别赋值给多个变量。

# 1、元组组包
t1 = (1, 3, 2, 4, 6),
t2 = "a", "b", "c", "d", "e"    # ⚠️，python 支持定义元组时不使用小括号。
print("定义元组的过程，就是对每个元素进行组包 = ", type(t2))

# 2、元组解包
# 基础解包，元组中有几个元素，就需要多少个变量来接收。
tup = (1,2,3)
a, b, c = tup
print(a, b, c)

# 扩展解包
# ⚠️⚠️⚠️，在元组解包时，可以使用 * 来表示剩余的元素，这些元素会被放在一个列表中。
# 优点：可以方便地处理不确定数量的元素。
tup2 = ("a", "b", "c", "d", "e")
a, *b, last = tup2
print(a)    # a
print(b)    # ['b', 'c', 'd']
print(last)    # e

# 3、借助元组的特性，实现交换变量的值
x = 10
y = 20

# # 步骤1 组包
# tmp = y, x
# # 步骤2 解包
# x, y = tmp

# 合并成一步
x, y = y, x
print(x, y)    # 20 10


a = 10
b = 20
c = 30

c, a, b = a, b, c
print(a, b, c)    # 30 10 20