# 👉 1、数据分析
# 数据分析：从一堆看似杂乱的数据中，通过数据清洗、分析、可视化等手段，找出有价值的信息和结论，
# 从而帮我们解决实际的问题(如：用户订单数据的分析、电影榜单数据分析、学校学生成绩分析等)。
# 
# 👉 2、数据分析的步骤：
#   - 数据收集，如：爬虫抓取数据、数据库、API、文件等
#   - 数据清洗处理，如：去除重复数据、去除缺失数据、去除异常数据、数据前后一致性检查等
#   - 数据分析，从数据中提取有用的数据，然后进行整理汇总。如：统计、分类、聚类、关联分析等
#   - 数据可视化，将数据可视化的展示出来。如：柱状图、折线图、饼图、散点图等
#
# 👉 3、数据分析的工具
# 在 Python 中，并不需要通过原始的代码一步一步操作（数据采集、数据清洗、数据分析）来实现数据分析，而是可以通过一些工具来辅助我们进行数据分析。
# 通常使用 Pandas 库来完成数据分析，使用 Matplotlib 库来完成数据可视化。
#


# 目录：
# 1、环境准备
#   - Jupyter Notebook 简介
#
# 2、pandas 基础
#   - Pandas 初体验
#   - 数据读取与写入
#   - 数据查看、选择、过滤
#   - 数据清洗
#   - 数据排序与分组
#
# 3、matplotlib 库
#
# 4、数据分析案例
#