# 👉 1、字符串拼接
# 字符串、字符串类型的变量可以使用 + 进行拼接。
name = "小明"
age = "18"
msg = name + "今年" + age + "岁了"
print("msg = ", msg)

# 多个字符串字面量直接写在一起，会自动拼接
say = "人生苦短，" "我用Python"
print("say = ", say)

# ⚠️，+号可以用来拼接两个字符串，但是无法将非字符串与字符串进行拼接(非字符串类型需要转换为字符串类型)。
price = 100.00
# desc = "这个玩具的价格为：" + price + "元" # 报错

# 1.1、str() 函数将其他类型转换为字符串类型
print("这个玩具的价格为：" + str(price) + "元")


print("-----------------")

# 👉 2、字符串格式化
# 方式1: 使用 `%占位符`
# `%占位符`，`%s` 表示字符串，`%d` 表示整数，`%f` 表示浮点数
# 通过 `%占位符` 将变量值插入到字符串中，来实现字符串和变量的拼接。
name = "小明"
print("你的名字是：%s" % name)
age = 18
msg = "%s今年%d岁了" % (name, age)
print("msg = ", msg)

print("------")

# 方式2: 使用 `f字符串`  --- 推荐!
# `f"字符串内容{变量名/表达式}"`, 变量名/表达式会被替换为变量值.
name = "小明"
print(f"你的名字是：{name}")
age = 18
msg = f"{name}今年{age}岁了"
print("msg = ", msg)

print("-----------------")